RefersToExternalResourceReference Method
 Determines whether this Element uses external resources associated with a specified external resource type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public bool RefersToExternalResourceReference(
	ExternalResourceType resourceType
)
Visual Basic
Public Function RefersToExternalResourceReference ( _
	resourceType As ExternalResourceType _
) As Boolean
Visual C++
public:
bool RefersToExternalResourceReference(
	ExternalResourceType^ resourceType
)
Parameters
resourceType
Type: Autodesk.Revit.DBExternalResourceType
 The desired external resource type.
Return Value
 Returns true if this Element uses external resources associated with the specified external resource type; otherwise, false.
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsArgumentNullException |  A non-optional argument was null
See Also
Element Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →